{
  "backend/main.mo": "Empty Motoko actor with no functionality; backend is unused as all calculations are client-side.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: total profit calculation across markets and introduction section with business scenario text.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing the pricing simulator architecture, components, utilities, and styling.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark modes using warm leather-inspired earth tones.",
  "frontend/index.html": "HTML entry point with title 'Pricing Simulation - Leather Exports' and root div for React mounting.",
  "frontend/src/App.tsx": "Root application component rendering header, PricingSimulator main content, and footer with caffeine.ai attribution.",
  "frontend/src/components/MarketSection.tsx": "Market card component displaying capacity, fixed cost, price selector, and calculated demand, quantity sold, revenue, costs, and profit with special handling for Market 5's enter/exit toggle.",
  "frontend/src/components/PricingSimulator.tsx": "Main simulator component managing state for 5 markets with configurable capacities and fixed costs, displaying introduction section and calculating/displaying total profit across all markets.",
  "frontend/src/hooks/useActor.ts": "React hook for managing ICP backend actor instances with authentication support, though unused in this client-side-only application.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication with login/logout functionality, though authentication is not required for this application.",
  "frontend/src/hooks/useQueries.ts": "Intentionally empty file with comment explaining all calculations are client-side and no backend queries are needed.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm leather-inspired color palette for both light and dark modes, including primary, secondary, muted, accent, success, destructive, border, and chart colors using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, rendering the main App component.",
  "frontend/src/utils/constants.ts": "Exports a single constant MARGINAL_COST_PER_UNIT set to 1200, representing the variable cost per unit in the pricing simulation.",
  "frontend/src/utils/demandTable.ts": "Defines a demand lookup table mapping 9 price points (₹2,500 to ₹6,500) to their corresponding demand quantities (850 to 395), with a helper function to retrieve demand for a given price.",
  "frontend/src/utils/formatCurrency.ts": "Utility function that formats numbers as Indian Rupee currency strings using Indian numbering system (en-IN locale), handling negative values and displaying the ₹ symbol.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the default theme with custom colors mapped to CSS variables (using OKLCH), custom border radius values, box shadows, font families (Inter and Merriweather), and accordion animations, plus typography and container-queries plugins.",
  "project_state.json": "Project metadata describing a leather export pricing simulation with 5 markets, fixed demand curves, capacity constraints, and profit calculations. Lists 10 implemented features covering market display, price selection, demand lookup, and profit calculations including Market 5 entry toggle."
}