{
  "kind": "build_request",
  "title": "Add total profit display and introduction text",
  "projectName": "Leather Export Simulator",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-12",
      "text": "Calculate and display the total profit across all 5 markets by summing individual market profits. When Market 5 is set to 'Do Not Enter', its profit (₹0) should still be included in the sum. Display the total prominently with Indian Rupee (₹) formatting.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Display total profit across all markets"
        ]
      },
      "acceptanceCriteria": [
        "Total profit is calculated as the sum of all 5 market profits",
        "Total profit updates automatically when any market's price selection changes",
        "Total profit correctly reflects ₹0 for Market 5 when 'Do Not Enter' is selected",
        "Total profit is displayed with proper Indian Rupee (₹) formatting using the existing formatCurrency utility",
        "Total profit display is visually prominent and clearly labeled"
      ]
    },
    {
      "id": "REQ-13",
      "text": "Add an introduction section at the top of the page with the heading 'Introduction' followed by this exact text: 'You are the owner of an Indian leather manufacturing and export company producing premium leather shoes and belts. Your company operates in five different export markets, each with different cost structures and production capacities. In every market, you must choose a selling price. Demand depends on the price you select, and production is subject to capacity constraints. Some markets involve fixed operating costs, while others do not. In one market, you also have the option to enter or stay out. Your objective is to maximize total profit across all five markets. The goal is not to sell the highest quantity, but to carefully balance price, demand, cost, and capacity to achieve the highest overall profitability. Make your pricing decisions strategically and observe how they impact revenue, cost, and profit in each market.'",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "also add intro text: Introduction\n\nYou are the owner of an Indian leather manufacturing and export company"
        ]
      },
      "acceptanceCriteria": [
        "Introduction section appears at the top of the page, above the market sections",
        "Heading 'Introduction' is clearly visible and properly styled",
        "All provided introduction text is displayed exactly as specified",
        "Text is formatted with appropriate line breaks between paragraphs for readability",
        "Introduction styling matches the warm leather-inspired design theme of the application"
      ]
    }
  ],
  "constraints": [
    "Use the existing formatCurrency utility function for Indian Rupee formatting",
    "Maintain the warm earth tones color scheme (browns, tans, creams) consistent with the leather goods industry aesthetic",
    "Do not modify the backend/main.mo file as all calculations remain client-side",
    "Preserve existing market calculation logic and formulas"
  ],
  "nonGoals": [
    "Adding export or download functionality for scenarios",
    "Modifying the demand table or price points",
    "Changing the existing market capacity or fixed cost values",
    "Adding user authentication or data persistence",
    "Modifying the Market 5 toggle functionality"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}